/**
 * Created by lonelydawn on 2017-04-02.
 */

app.controller('courseCtrl',['$scope','$state',function($scope,$state){
    //格局课程 直播课程体系
    $scope.weekCourses = {
        "weekday": ["星期一","星期二","星期三","星期四","星期五","星期六","星期天"],
        "course": [
            ["无","无","思想格局"],
            ["隔代教育","无","思想格局"],
            ["家庭教育","家族传承","思想格局"],
            ["创新格局","创新格局","思想格局"],
            ["品牌格局","品牌格局","系统格局"],
            ["格局新资本","青少年梦想教育格局素养","系统格局"],
            ["格局新资本","格局素养","系统格局"]
        ]
    };

    //格局课程 公益课程体系
    $scope.publicCourses = [
        {
            "title": "A 企业家•卓越家族成长课程",
            "label": ["课程体系","课程内容"],
            "cols": [
                {
                    "col1": "开篇",
                    "col2": "《社会转型期——家庭教育十大误区与十大败局》"
                },{
                    "col1": "“爱”系列",
                    "col2": "《爱情真相与婚姻的经营之道》"
                },{
                    "col1": "",
                    "col2": "《智慧母亲，家（民）族卓越与繁盛的基石》"
                },{
                    "col1": "",
                    "col2": "《童年经历•心灵成长与舞动减压》"
                },{
                    "col1": "“育”系列",
                    "col2": "《少年领袖“三商”（情商、智商、财商）培养方案》"
                },{
                    "col1": "",
                    "col2": "《考试制度变革与子女培养目标异动方略》"
                },{
                    "col1": "“家”系列",
                    "col2": "《子女成长红线图:生涯规划与出国留学》"
                },{
                    "col1": "",
                    "col2": "《名门望族耀眼星河的传世秘籍》"
                },{
                    "col1": "",
                    "col2": "《有“礼”走遍天下:礼文化在子女教育中的妙用》"
                }
            ]
        },{
            "title": "B 夫人•家长教练工坊",
            "label": ["课程体系","课程内容"],
            "cols": [
                {
                    "col1": "家庭幸福密码",
                    "col2": "《一个好母亲兴旺四代人》"
                },{
                    "col1": "",
                    "col2": "《女性三重角色定位与自我修养》"
                },{
                    "col1": "",
                    "col2": "《爱情与婚姻关系》"
                },{
                    "col1": "",
                    "col2": "《家庭幸福教练》"
                },{
                    "col1": "学习力提升宝典",
                    "col2": "《注意力训练》"
                },{
                    "col1": "",
                    "col2": "《记忆力提升》"
                },{
                    "col1": "",
                    "col2": "《阅读能力培养》"
                },{
                    "col1": "",
                    "col2": "《时间管理秘方》"
                },{
                    "col1": "",
                    "col2": "《创新能力拓展》"
                },{
                    "col1": "情商训练秘籍",
                    "col2": "《情感•情绪•价值观》"
                },{
                    "col1": "",
                    "col2": "《培养好习惯•客服坏习惯》"
                },{
                    "col1": "",
                    "col2": "《女孩•男孩培养策略》"
                },{
                    "col1": "",
                    "col2": "《人际关系•沟通技巧》"
                }
            ]
        },{
            "title": "C 子女•少年领袖梦想训",
            "label": ["课程体系","课程内容"],
            "cols": [
                {
                    "col1": "开篇",
                    "col2": "《站在未来看现在》"
                },{
                    "col1": "梦想起航系列",
                    "col2": "《点燃与唤醒生命内在的能量》"
                },{
                    "col1": "修身养德系列",
                    "col2": "《汉字:国学传统的大河之源》"
                },{
                    "col1": "动手实践系列",
                    "col2": "《生活中的科学实验》"
                },{
                    "col1": "科学观察系列",
                    "col2": "《仰望星空与太空探秘》"
                }
            ]
        },{
            "title": "D 祖辈•隔代教养方法与学习课程",
            "label": ["项目共享课程","项目独享活动课程"],
            "cols": [
                {
                    "col1": "《社会转型期——家庭教育十大误区与十大败局》",
                    "col2": "《祖辈家庭教育中的角色定位与代际关系》"
                },{
                    "col1": "《少年领袖“三商”（情商、智商、财商）培养方案》",
                    "col2": "《隔代教育的“孙子兵法”与习惯养成训练》"
                },{
                    "col1": "《子女成长红线图:生涯规划与出国留学》",
                    "col2": "《电子产品替代玩具、学具与“管惯”策略应付》"
                },{
                    "col1": "《有“礼”走遍天下:生涯规划与出国留学》",
                    "col2": "《童年经历、原生家庭与孩子人格养成》"
                }
            ]
        }
    ];

    $scope.weekdays = $scope.weekCourses.weekday;
    $scope.courses = $scope.weekCourses.course;
    $scope.selectedName = $scope.weekdays[0];
    $scope.course = $scope.courses[0];

    $scope.changeWeekCourse = function(){
        var index= $scope.weekdays.indexOf($scope.selectedName);
        console.log("下标为:"+index);
        $scope.course = $scope.courses[index];
    };

    $scope.courseModalShow = function(item){
        $scope.courseName = item;
        $("#CourseModal").modal("show");
    };
}]);